src/Enums/ОбработчикиДрайверовПодключаемогоОборудования/ОбработчикиДрайверовПодключаемогоОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ОбработчикиДрайверовПодключаемогоОборудования</name>
  <enumValues>
    <name>Обработчик1СWebСервисОборудование</name>
    <comment>WebСервисОборудование</comment>
  </enumValues>
  <enumValues>
    <name>Обработчик1СДисплейПокупателя</name>
    <comment>ДисплейПокупателя</comment>
  </enumValues>
  <enumValues>
    <name>Обработчик1СККМOffline</name>
    <comment>ККМOffline</comment>
  </enumValues>
  <enumValues>
    <name>Обработчик1СПринтерЧеков</name>
    <comment>ПринтерЧеков</comment>
  </enumValues>
  <enumValues>
    <name>Обработчик1СРарусФискальныеРегистраторыМебиус</name>
    <comment>ФискальныйРегистратор</comment>
  </enumValues>
  <enumValues>
    <name>Обработчик1СРарусФискальныеРегистраторыФеликс</name>
    <comment>ФискальныйРегистратор</comment>
  </enumValues>
  <enumValues>
    <name>Обработчик1ССканерыШтрихкода</name>
    <comment>СканерШтрихкода</comment>
  </enumValues>
  <enumValues>
    <name>Обработчик1ССканерыШтрихкодаNative</name>
    <comment>СканерШтрихкода</comment>
  </enumValues>
  <enumValues>
    <name>Обработчик1ССчитывателиМагнитныхКарт</name>
    <comment>СчитывательМагнитныхКарт</comment>
  </enumValues>
  <enumValues>
    <name>Обработчик1ССчитывателиМагнитныхКартNative</name>
    <comment>СчитывательМагнитныхКарт</comment>
  </enumValues>
  <enumValues>
    <name>Обработчик1СФискальныйРегистраторЭмулятор</name>
    <comment>ФискальныйРегистратор</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикACOMВесыСПечатьюЭтикеток</name>
    <comment>ВесыСПечатьюЭтикеток</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикARCUS2ЭквайринговыеТерминалыIngenico</name>
    <comment>ЭквайринговыйТерминал</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикCASВесыСПечатьюЭтикеток</name>
    <comment>ВесыСПечатьюЭтикеток</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикCASЭлектронныеВесы</name>
    <comment>ЭлектронныеВесы</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикERFIDСчитывательRFID</name>
    <comment>СчитывательRFID</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикIboxProПоддержкаMPosЭквайринга</name>
    <comment>ЭквайринговыйТерминал</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикIronLogicСчитывателиБесконтактныхКарт</name>
    <comment>СчитывательМагнитныхКарт</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикScaleCASВесыСПечатьюЭтикеток</name>
    <comment>ВесыСПечатьюЭтикеток</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикTRPOSЭквайринговыеТерминалы</name>
    <comment>ЭквайринговыйТерминал</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикUCSEFTPOSЭквайринговыеТерминалы</name>
    <comment>ЭквайринговыйТерминал</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикАтолДисплеиПокупателя</name>
    <comment>ДисплейПокупателя</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикАтолДисплеиПокупателя8X</name>
    <comment>ДисплейПокупателя</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикАтолККМOffline</name>
    <comment>ККМOffline</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикАтолСканерыШтрихкода</name>
    <comment>СканерШтрихкода</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикАтолСканерыШтрихкода8X</name>
    <comment>СканерШтрихкода</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикАтолСчитывателиМагнитныхКарт</name>
    <comment>СчитывательМагнитныхКарт</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикАтолСчитывателиМагнитныхКарт8X</name>
    <comment>СчитывательМагнитныхКарт</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикАтолТерминалыСбораДанных</name>
    <comment>ТерминалСбораДанных</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикАтолТерминалыСбораДанныхMobileLogistics</name>
    <comment>ТерминалСбораДанных</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикАтолФискальныеРегистраторы</name>
    <comment>ФискальныйРегистратор</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикАтолФискальныеРегистраторы8X</name>
    <comment>ФискальныйРегистратор</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикАтолФискальныеРегистраторыУниверсальный</name>
    <comment>ФискальныйРегистратор</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикАтолЭлектронныеВесы</name>
    <comment>ЭлектронныеВесы</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикАтолЭлектронныеВесы8X</name>
    <comment>ЭлектронныеВесы</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикВерсияТФискальныеРегистраторы</name>
    <comment>ФискальныйРегистратор</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикГАЗПРОМБАНКЭквайринговыеТерминалы</name>
    <comment>ЭквайринговыйТерминал</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикГексагонПринтераЭтикеток</name>
    <comment>ПринтерЭтикеток</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикГексагонСканерыШтрихкода</name>
    <comment>СканерШтрихкода</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикГексагонТерминалыСбораДанных</name>
    <comment>ТерминалСбораДанных</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикДримкасФискальныеРегистраторыVikiPrint</name>
    <comment>ФискальныйРегистратор</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикИНПАСЭквайринговыеТерминалыPulsar</name>
    <comment>ЭквайринговыйТерминал</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикИНПАСЭквайринговыеТерминалыSmart</name>
    <comment>ЭквайринговыйТерминал</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикИНПАСЭквайринговыеТерминалыUNIPOS</name>
    <comment>ЭквайринговыйТерминал</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикККСДисплеиПокупателя</name>
    <comment>ДисплейПокупателя</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикККСФискальныеРегистраторы</name>
    <comment>ФискальныйРегистратор</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикКлеверенсСчитывателиRFID</name>
    <comment>СчитывательRFID</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикКлеверенсТерминалыСбораДанных</name>
    <comment>ТерминалСбораДанных</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикКристаллСервисДисплеиПокупателяVikiVision</name>
    <comment>ДисплейПокупателя</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикКристаллСервисФискальныеРегистраторыPirit</name>
    <comment>ФискальныйРегистратор</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикМассаКВесыСПечатьюЭтикеток</name>
    <comment>ВесыСПечатьюЭтикеток</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикМассаКЭлектронныеВесы</name>
    <comment>ЭлектронныеВесы</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикОРИОНФискальныеРегистраторы</name>
    <comment>ФискальныйРегистратор</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикПриватбанкЭквайринговыеТерминалы</name>
    <comment>ЭквайринговыйТерминал</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикСБРФЭквайринговыеТерминалы</name>
    <comment>ЭквайринговыйТерминал</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикСканкодДисплеиПокупателя</name>
    <comment>ДисплейПокупателя</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикСканкодПринтераЭтикетокGodexEZPL8Native</name>
    <comment>ПринтерЭтикеток</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикСканкодСканерыШтрихкода</name>
    <comment>СканерШтрихкода</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикСканкодТерминалыСбораДанных</name>
    <comment>ТерминалСбораДанных</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикСканкодТерминалыСбораДанныхNative</name>
    <comment>ТерминалСбораДанных</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикСканситиПринтераЭтикеток</name>
    <comment>ПринтерЭтикеток</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикСканситиТерминалыСбораДанных</name>
    <comment>ТерминалСбораДанных</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикСофтКейсЭквайринговыеТерминалы</name>
    <comment>ЭквайринговыйТерминал</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикШтрихМВесыСПечатьюЭтикеток</name>
    <comment>ВесыСПечатьюЭтикеток</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикШтрихМДисплеиПокупателя</name>
    <comment>ДисплейПокупателя</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикШтрихМККМOffline</name>
    <comment>ККМOffline</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикШтрихМТерминалыСбораДанных</name>
    <comment>ТерминалСбораДанных</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикШтрихМФискальныеРегистраторы</name>
    <comment>ФискальныйРегистратор</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикШтрихМФискальныеРегистраторыУниверсальный</name>
    <comment>ФискальныйРегистратор</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикШтрихМЭлектронныеВесы</name>
    <comment>ЭлектронныеВесы</comment>
  </enumValues>
</mdclass:Enum>

src/CommonModules/МенеджерОборудованияКлиентПереопределяемый/Module.bsl
#Область ПрограммныйИнтерфейс

// Возвращает текущую дату, приведенную к часовому поясу сеанса.
// Предназначена для использования вместо функции ТекущаяДата().
//
Функция ДатаСеанса() Экспорт
	
	Возврат ТекущаяДата();
	
КонецФункции

// Функция возвращает объект обработчика драйвера по его наименованию.
//
Функция ПолучитьОбработчикДрайвера(ОбработчикДрайвера, ЗагружаемыйДрайвер) Экспорт
	
	// Используем универсальный обработчик драйвера по стандарту "1С:Совместимо".
#Если ВебКлиент Тогда
	Результат = ПодключаемоеОборудованиеУниверсальныйДрайверАсинхронноКлиент; 
#Иначе
	Результат = ПодключаемоеОборудованиеУниверсальныйДрайверКлиент;
#КонецЕсли

	// Обработчики драйверов не удовлетворяющие стандарту "1С:Совместимо".
	Если Не ЗагружаемыйДрайвер И ОбработчикДрайвера <> Неопределено Тогда
		
		// Сканеры штрихкода
		Если ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.Обработчик1ССканерыШтрихкода") Тогда
			Возврат ПодключаемоеОборудование1ССканерыШтрихкодаКлиент;
		ИначеЕсли ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикСканкодСканерыШтрихкода") Тогда
			Возврат ПодключаемоеОборудованиеСканкодСканерыШтрихкодаКлиент;
		ИначеЕсли ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикАтолСканерыШтрихкода") Тогда
			Возврат ПодключаемоеОборудованиеАтолСканерыШтрихкодаКлиент;
		КонецЕсли;
		// Конец Сканеры штрихкода
				
		// Терминалы сбора данных
		Если ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикАтолТерминалыСбораДанных") Тогда
			Возврат ПодключаемоеОборудованиеАтолТерминалыСбораДанныхКлиент;
		ИначеЕсли ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикШтрихМТерминалыСбораДанных") Тогда
			Возврат ПодключаемоеОборудованиеШтрихМТерминалыСбораДанныхКлиент;
		ИначеЕсли ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикСканкодТерминалыСбораДанных") Тогда
			Возврат ПодключаемоеОборудованиеСканкодТерминалыСбораДанныхКлиент;
		ИначеЕсли ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикСканситиТерминалыСбораДанных") Тогда
			Возврат ПодключаемоеОборудованиеСканситиТерминалыСбораДанныхКлиент;
		КонецЕсли;
		// Конец Терминалы сбора данных.
				
		// Web-сервис оборудование
		Если ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.Обработчик1СWebСервисОборудование") Тогда
			Возврат Неопределено;
		КонецЕсли;
		// Конец Web-сервис оборудование

	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Переопределяет формируемый шаблон чека.
//
Функция СформироватьШаблонЧека(ВходныеПараметры, ДополнительныйТекст, СтандартнаяОбработка) Экспорт
	
КонецФункции

// Переопределяет формируемый текст нефискального чека по шаблону.
//
Функция СформироватьТексНефискальногоЧека(ШиринаСтроки, ВходныеПараметры, СтандартнаяОбработка) Экспорт
	
КонецФункции

// Переопределяет печать чека по шаблону.
//
Функция ПечатьЧекаПоШаблону(ОбщийМодульОборудования, ОбъектДрайвера, Параметры, ПараметрыПодключения, ВходныеПараметры, ВыходныеПараметры, СтандартнаяОбработка) Экспорт
	
КонецФункции

// Переопределяет печать фискального чека.
//
Функция ПечатьЧека(ОбщийМодульОборудования, ОбъектДрайвера, Параметры, ПараметрыПодключения, ВходныеПараметры, ВыходныеПараметры, СтандартнаяОбработка) Экспорт
	
КонецФункции

#КонецОбласти

#Область ПроцедурыПодключенияОтключенияОборудования

// Начать подключение необходимых типов оборудования при открытии формы.
//
// Параметры:
// Форма - УправляемаяФорма
// ПоддерживаемыеТипыПодключаемогоОборудования - Строка
//  Содержит перечень типов подключаемого оборудования, разделенных запятыми.
//
Процедура НачатьПодключениеОборудованиеПриОткрытииФормы(Форма, ПоддерживаемыеТипыПодключаемогоОборудования) Экспорт
	
	МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПриОткрытииФормы(Неопределено, Форма, ПоддерживаемыеТипыПодключаемогоОборудования);
	
КонецПроцедуры

// Начать отключать оборудование по типу при закрытии формы.
//
Процедура НачатьОтключениеОборудованиеПриЗакрытииФормы(Форма) Экспорт
	
	МенеджерОборудованияКлиент.НачатьОтключениеОборудованиеПриЗакрытииФормы(Неопределено, Форма);
	
КонецПроцедуры

#КонецОбласти
 
#Область РаботаСФормойЭкземпляраОборудования

// Дополнительные переопределяемые действия с управляемой формой в Экземпляре оборудования
// при событии "ПриОткрытии".
//
Процедура ЭкземплярОборудованияПриОткрытии(Объект, ЭтаФорма, Отказ) Экспорт
	
КонецПроцедуры

// Дополнительные переопределяемые действия с управляемой формой в Экземпляре оборудования
// при событии "ПередЗакрытием".
//
Процедура ЭкземплярОборудованияПередЗакрытием(Объект, ЭтаФорма, Отказ, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

// Дополнительные переопределяемые действия с управляемой формой в Экземпляре оборудования
// при событии "ПередЗаписью".
//
Процедура ЭкземплярОборудованияПередЗаписью(Объект, ЭтаФорма, Отказ, ПараметрыЗаписи) Экспорт
	
КонецПроцедуры

// Дополнительные переопределяемые действия с управляемой формой в Экземпляре оборудования
// при событии "ПослеЗаписи".
//
Процедура ЭкземплярОборудованияПослеЗаписи(Объект, ЭтаФорма, ПараметрыЗаписи) Экспорт
	
КонецПроцедуры

// Дополнительные переопределяемые действия с управляемой формой в Экземпляре оборудования
// при событии "ТипОборудованияОбработкаВыбора".
//
Процедура ЭкземплярОборудованияТипОборудованияВыбор(Объект, ЭтаФорма, ЭтотОбъект, Элемент, ВыбранноеЗначение) Экспорт
	
КонецПроцедуры

#КонецОбласти
